qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/usb_device_udd.c
    ptr_job = udd_ep_get_job(ep);
    ep_num  = ep & USB_EP_ADDR_MASK;

    ep_size = ptr_job->ep_size;
    /* Update number of data transferred */
    nb_trans = ep_callback_para->sent_bytes;
    ptr_job->nb_trans += nb_trans;

    /* Need to send other data */
    if (ptr_job->nb_trans != ptr_job->buf_size) {
        next_trans = ptr_job->buf_size - ptr_job->nb_trans;
        if (UDD_ENDPOINT_MAX_TRANS < next_trans) {
            /* The USB hardware support a maximum
             * transfer size of UDD_ENDPOINT_MAX_TRANS Bytes */
            next_trans = UDD_ENDPOINT_MAX_TRANS - (UDD_ENDPOINT_MAX_TRANS % ep_size);
        }
        /* Need ZLP, if requested and last packet is not a short packet */
        ptr_job->b_shortpacket = ptr_job->b_shortpacket && (0 == (next_trans % ep_size));
        usb_device_endpoint_write_buffer_job(&usb_device, ep_num, &ptr_job->buf[ptr_job->nb_trans], next_trans);
        return;
    }

    /* Need to send a ZLP after all data transfer */
    if (ptr_job->b_shortpacket) {
        ptr_job->b_shortpacket = false;
        /* Start new transfer */
        usb_device_endpoint_write_buffer_job(&usb_device, ep_num, &ptr_job->buf[ptr_job->nb_trans], 0);
        return;
    }

    /* Job complete then call callback */
    ptr_job->busy = false;
    if (NULL != ptr_job->call_trans) {
        ptr_job->call_trans(UDD_EP_TRANSFER_OK, ptr_job->nb_trans, ep);
    }
}

/**
 * \brief     Endpoint OUT process, continue to receive packets or zero length packet
 * \param[in] pointer Pointer to the endpoint transfer status parameter struct from driver layer.
 */
static void udd_ep_trans_out_next(void *pointer) {
    struct usb_endpoint_callback_parameter *ep_callback_para = (struct usb_endpoint_callback_parameter *)pointer;
    udd_ep_id_t                             ep               = ep_callback_para->endpoint_address;
    uint16_t                                ep_size, nb_trans;
    uint16_t                                next_trans;
    udd_ep_id_t                             ep_num;
    udd_ep_job_t *                          ptr_job;

    ptr_job = udd_ep_get_job(ep);
    ep_num  = ep & USB_EP_ADDR_MASK;

    ep_size = ptr_job->ep_size;
    /* Update number of data transferred */
    nb_trans = ep_callback_para->received_bytes;

    /* Can be necessary to copy data receive from cache buffer to user buffer */
    if (ptr_job->b_use_out_cache_buffer) {
        memcpy(&ptr_job->buf[ptr_job->nb_trans], udd_ep_out_cache_buffer[ep_num - 1], ptr_job->buf_size % ep_size);
    }

    /* Update number of data transferred */
    ptr_job->nb_trans += nb_trans;
    if (ptr_job->nb_trans > ptr_job->buf_size) {
        ptr_job->nb_trans = ptr_job->buf_size;
    }

    /* If all previous data requested are received and user buffer not full
     * then need to receive other data */
    if ((nb_trans == ep_callback_para->out_buffer_size) && (ptr_job->nb_trans != ptr_job->buf_size)) {
        next_trans = ptr_job->buf_size - ptr_job->nb_trans;
        if (UDD_ENDPOINT_MAX_TRANS < next_trans) {
            /* The USB hardware support a maximum transfer size
             * of UDD_ENDPOINT_MAX_TRANS Bytes */
            next_trans = UDD_ENDPOINT_MAX_TRANS - (UDD_ENDPOINT_MAX_TRANS % ep_size);
        } else {
            next_trans -= next_trans % ep_size;
        }

        if (next_trans < ep_size) {
            /* Use the cache buffer for Bulk or Interrupt size endpoint */
            ptr_job->b_use_out_cache_buffer = true;
            usb_device_endpoint_read_buffer_job(&usb_device, ep_num, udd_ep_out_cache_buffer[ep_num - 1], ep_size);
        } else {
            usb_device_endpoint_read_buffer_job(&usb_device, ep_num, &ptr_job->buf[ptr_job->nb_trans], next_trans);
        }
        return;
    }

    /* Job complete then call callback */
    ptr_job->busy = false;
    if (NULL != ptr_job->call_trans) {
        ptr_job->call_trans(UDD_EP_TRANSFER_OK, ptr_job->nb_trans, ep);
    }
}

/**
 * \brief     Endpoint Transfer Complete callback function, to do the next transfer depends on the direction(IN or OUT)
 * \param[in] module_inst Pointer to USB module instance
 * \param[in] pointer Pointer to the endpoint transfer status parameter struct from driver layer.
 */
static void udd_ep_transfer_process(struct usb_module *module_inst, void *pointer) {
    struct usb_endpoint_callback_parameter *ep_callback_para = (struct usb_endpoint_callback_parameter *)pointer;
    udd_ep_id_t                             ep               = ep_callback_para->endpoint_address;

    if (ep & USB_EP_DIR_IN) {
        udd_ep_trans_in_next(pointer);
    } else {
        udd_ep_trans_out_next(pointer);
    }
}

void udd_ep_abort(udd_ep_id_t ep) {
    udd_ep_job_t *ptr_job;

    usb_device_endpoint_abort_job(&usb_device, ep);

    /* Job complete then call callback */
    ptr_job = udd_ep_get_job(ep);
    if (!ptr_job->busy) {
        return;
    }
    ptr_job->busy = false;
    if (NULL != ptr_job->call_trans) {
        /* It can be a Transfer or stall callback */
        ptr_job->call_trans(UDD_EP_TRANSFER_ABORT, ptr_job->nb_trans, ep);
    }
}

bool udd_is_high_speed(void) { return false; }

uint16_t udd_get_frame_number(void) { return usb_device_get_frame_number(&usb_device); }

uint16_t udd_get_micro_frame_number(void) { return usb_device_get_micro_frame_number(&usb_device); }

void udd_ep_free(udd_ep_id_t ep) {
    struct usb_device_endpoint_config config_ep;
    usb_device_endpoint_get_config_defaults(&config_ep);

    uint8_t ep_num = ep & USB_EP_ADDR_MASK;
    udd_ep_abort(ep);

    config_ep.ep_address = ep;
    config_ep.ep_type    = USB_DEVICE_ENDPOINT_TYPE_DISABLE;
    usb_device_endpoint_set_config(&usb_device, &config_ep);
    usb_device_endpoint_unregister_callback(&usb_device, ep_num, USB_DEVICE_ENDPOINT_CALLBACK_TRCPT);
    usb_device_endpoint_disable_callback(&usb_device, ep, USB_DEVICE_ENDPOINT_CALLBACK_TRCPT);
}

bool udd_ep_alloc(udd_ep_id_t ep, uint8_t bmAttributes, uint16_t MaxEndpointSize) {
    struct usb_device_endpoint_config config_ep;
    usb_device_endpoint_get_config_defaults(&config_ep);

    config_ep.ep_address = ep;

    if (MaxEndpointSize <= 8) {
        config_ep.ep_size = USB_ENDPOINT_8_BYTE;
    } else if (MaxEndpointSize <= 16) {
        config_ep.ep_size = USB_ENDPOINT_16_BYTE;
    } else if (MaxEndpointSize <= 32) {
        config_ep.ep_size = USB_ENDPOINT_32_BYTE;
    } else if (MaxEndpointSize <= 64) {
        config_ep.ep_size = USB_ENDPOINT_64_BYTE;
    } else if (MaxEndpointSize <= 128) {
        config_ep.ep_size = USB_ENDPOINT_128_BYTE;
    } else if (MaxEndpointSize <= 256) {
        config_ep.ep_size = USB_ENDPOINT_256_BYTE;
    } else if (MaxEndpointSize <= 512) {
        config_ep.ep_size = USB_ENDPOINT_512_BYTE;
    } else if (MaxEndpointSize <= 1023) {
        config_ep.ep_size = USB_ENDPOINT_1023_BYTE;
    } else {
        return false;
    }
    udd_ep_job_t *ptr_job = udd_ep_get_job(ep);
    ptr_job->ep_size      = MaxEndpointSize;

    bmAttributes = bmAttributes & USB_EP_TYPE_MASK;

    /* Check endpoint type */
    if (USB_EP_TYPE_ISOCHRONOUS == bmAttributes) {
        config_ep.ep_type = USB_DEVICE_ENDPOINT_TYPE_ISOCHRONOUS;
    } else if (USB_EP_TYPE_BULK == bmAttributes) {
        config_ep.ep_type = USB_DEVICE_ENDPOINT_TYPE_BULK;
    } else if (USB_EP_TYPE_INTERRUPT == bmAttributes) {
        config_ep.ep_type = USB_DEVICE_ENDPOINT_TYPE_INTERRUPT;
    } else {
        return false;
    }

