qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/usb_device_udd.c
    uint8_t ep_num = ep & USB_EP_ADDR_MASK;

    if (STATUS_OK != usb_device_endpoint_set_config(&usb_device, &config_ep)) {
        return false;
    }
    usb_device_endpoint_register_callback(&usb_device, ep_num, USB_DEVICE_ENDPOINT_CALLBACK_TRCPT, udd_ep_transfer_process);
    usb_device_endpoint_enable_callback(&usb_device, ep, USB_DEVICE_ENDPOINT_CALLBACK_TRCPT);
    usb_device_endpoint_enable_callback(&usb_device, ep, USB_DEVICE_ENDPOINT_CALLBACK_TRFAIL);

    return true;
}

bool udd_ep_is_halted(udd_ep_id_t ep) { return usb_device_endpoint_is_halted(&usb_device, ep); }

bool udd_ep_set_halt(udd_ep_id_t ep) {
    uint8_t ep_num = ep & USB_EP_ADDR_MASK;

    if (USB_DEVICE_MAX_EP < ep_num) {
        return false;
    }

    usb_device_endpoint_set_halt(&usb_device, ep);

    udd_ep_abort(ep);
    return true;
}

bool udd_ep_clear_halt(udd_ep_id_t ep) {
    udd_ep_job_t *ptr_job;
    uint8_t       ep_num = ep & USB_EP_ADDR_MASK;

    if (USB_DEVICE_MAX_EP < ep_num) {
        return false;
    }
    ptr_job = udd_ep_get_job(ep);

    usb_device_endpoint_clear_halt(&usb_device, ep);

    /* If a job is register on clear halt action then execute callback */
    if (ptr_job->busy == true) {
        ptr_job->busy = false;
        ptr_job->call_nohalt();
    }

    return true;
}

bool udd_ep_wait_stall_clear(udd_ep_id_t ep, udd_callback_halt_cleared_t callback) {
    udd_ep_id_t   ep_num;
    udd_ep_job_t *ptr_job;

    ep_num = ep & USB_EP_ADDR_MASK;
    if (USB_DEVICE_MAX_EP < ep_num) {
        return false;
    }

    ptr_job = udd_ep_get_job(ep);
    if (ptr_job->busy == true) {
        return false; /* Job already on going */
    }

    /* Wait clear halt endpoint */
    if (usb_device_endpoint_is_halted(&usb_device, ep)) {
        /* Endpoint halted then registers the callback */
        ptr_job->busy        = true;
        ptr_job->call_nohalt = callback;
        return true;
    } else if (usb_device_endpoint_is_configured(&usb_device, ep)) {
        callback(); /* Endpoint not halted then call directly callback */
        return true;
    } else {
        return false;
    }
}

/**
 * \brief Control Endpoint stall sending data
 */
static void udd_ctrl_stall_data(void) {
    udd_ep_control_state = UDD_EPCTRL_STALL_REQ;

    usb_device_endpoint_set_halt(&usb_device, USB_EP_DIR_IN);
    usb_device_endpoint_clear_halt(&usb_device, USB_EP_DIR_OUT);
}

bool udd_ep_run(udd_ep_id_t ep, bool b_shortpacket, uint8_t *buf, iram_size_t buf_size, udd_callback_trans_t callback) {
    udd_ep_id_t   ep_num;
    udd_ep_job_t *ptr_job;
    uint32_t      irqflags;

    ep_num = ep & USB_EP_ADDR_MASK;

    if ((USB_DEVICE_MAX_EP < ep_num) || (udd_ep_is_halted(ep))) {
        return false;
    }

    ptr_job = udd_ep_get_job(ep);

    irqflags = __get_PRIMASK();
    __disable_irq();
    __DMB();

    if (ptr_job->busy == true) {
        __DMB();
        __set_PRIMASK(irqflags);
        return false; /* Job already on going */
    }

    ptr_job->busy = true;
    __DMB();
    __set_PRIMASK(irqflags);

    /* No job running, set up a new one */
    ptr_job->buf                    = buf;
    ptr_job->buf_size               = buf_size;
    ptr_job->nb_trans               = 0;
    ptr_job->call_trans             = callback;
    ptr_job->b_shortpacket          = b_shortpacket;
    ptr_job->b_use_out_cache_buffer = false;

    /* Initialize value to simulate a empty transfer */
    uint16_t next_trans;

    if (ep & USB_EP_DIR_IN) {
        if (0 != ptr_job->buf_size) {
            next_trans = ptr_job->buf_size;
            if (UDD_ENDPOINT_MAX_TRANS < next_trans) {
                next_trans = UDD_ENDPOINT_MAX_TRANS - (UDD_ENDPOINT_MAX_TRANS % ptr_job->ep_size);
            }
            ptr_job->b_shortpacket = ptr_job->b_shortpacket && (0 == (next_trans % ptr_job->ep_size));
        } else if (true == ptr_job->b_shortpacket) {
            ptr_job->b_shortpacket = false; /* avoid to send zero length packet again */
            next_trans             = 0;
        } else {
            ptr_job->busy = false;
            if (NULL != ptr_job->call_trans) {
                ptr_job->call_trans(UDD_EP_TRANSFER_OK, 0, ep);
            }
            return true;
        }
        return (STATUS_OK == usb_device_endpoint_write_buffer_job(&usb_device, ep_num, &ptr_job->buf[0], next_trans));
    } else {
        if (0 != ptr_job->buf_size) {
            next_trans = ptr_job->buf_size;
            if (UDD_ENDPOINT_MAX_TRANS < next_trans) {
                /* The USB hardware support a maximum transfer size
                 * of UDD_ENDPOINT_MAX_TRANS Bytes */
                next_trans = UDD_ENDPOINT_MAX_TRANS - (UDD_ENDPOINT_MAX_TRANS % ptr_job->ep_size);
            } else {
                next_trans -= next_trans % ptr_job->ep_size;
            }
            if (next_trans < ptr_job->ep_size) {
                ptr_job->b_use_out_cache_buffer = true;
                return (STATUS_OK == usb_device_endpoint_read_buffer_job(&usb_device, ep_num, udd_ep_out_cache_buffer[ep_num - 1], ptr_job->ep_size));
            } else {
                return (STATUS_OK == usb_device_endpoint_read_buffer_job(&usb_device, ep_num, &ptr_job->buf[0], next_trans));
            }
        } else {
            ptr_job->busy = false;
            if (NULL != ptr_job->call_trans) {
                ptr_job->call_trans(UDD_EP_TRANSFER_OK, 0, ep);
            }
            return true;
        }
    }
}

void udd_set_address(uint8_t address) { usb_device_set_address(&usb_device, address); }

uint8_t udd_getaddress(void) { return usb_device_get_address(&usb_device); }

void udd_send_remotewakeup(void) {
    uint32_t try
        = 5;
    udd_wait_clock_ready();
    udd_sleep_mode(UDD_STATE_IDLE);
    while (2 != usb_get_state_machine_status(&usb_device) && try --) {
        usb_device_send_remote_wake_up(&usb_device);
    }
}

void udd_set_setup_payload(uint8_t *payload, uint16_t payload_size) {
    udd_g_ctrlreq.payload      = payload;
    udd_g_ctrlreq.payload_size = payload_size;
}

/**
 * \brief Control Endpoint translate the data in buffer into Device Request Struct
 */
static void udd_ctrl_fetch_ram(void) {
    udd_g_ctrlreq.req.bmRequestType = udd_ctrl_buffer[0];
    udd_g_ctrlreq.req.bRequest      = udd_ctrl_buffer[1];
    udd_g_ctrlreq.req.wValue        = ((uint16_t)(udd_ctrl_buffer[3]) << 8) + udd_ctrl_buffer[2];
    udd_g_ctrlreq.req.wIndex        = ((uint16_t)(udd_ctrl_buffer[5]) << 8) + udd_ctrl_buffer[4];
    udd_g_ctrlreq.req.wLength       = ((uint16_t)(udd_ctrl_buffer[7]) << 8) + udd_ctrl_buffer[6];
}

/**
 * \brief Control Endpoint send out zero length packet
 */
static void udd_ctrl_send_zlp_in(void) {
    udd_ep_control_state = UDD_EPCTRL_HANDSHAKE_WAIT_IN_ZLP;
    usb_device_endpoint_setup_buffer_job(&usb_device, udd_ctrl_buffer);
    usb_device_endpoint_write_buffer_job(&usb_device, 0, udd_g_ctrlreq.payload, 0);
}

/**
 * \brief Process control endpoint IN transaction
 */
static void udd_ctrl_in_sent(void) {
    static bool b_shortpacket = false;
    uint16_t    nb_remain;

    nb_remain = udd_g_ctrlreq.payload_size - udd_ctrl_payload_nb_trans;

    if (0 == nb_remain) {
        /* All content of current buffer payload are sent Update number of total data sending by previous payload buffer */
        udd_ctrl_prev_payload_nb_trans += udd_ctrl_payload_nb_trans;
        if ((udd_g_ctrlreq.req.wLength == udd_ctrl_prev_payload_nb_trans) || b_shortpacket) {
            /* All data requested are transferred or a short packet has been sent, then it is the end of data phase.
             * Generate an OUT ZLP for handshake phase */
            udd_ep_control_state = UDD_EPCTRL_HANDSHAKE_WAIT_OUT_ZLP;
            usb_device_endpoint_setup_buffer_job(&usb_device, udd_ctrl_buffer);
            return;
        }
        /* Need of new buffer because the data phase is not complete */
        if ((!udd_g_ctrlreq.over_under_run) || (!udd_g_ctrlreq.over_under_run())) {
            /* Under run then send zlp on IN
             * Here nb_remain=0, this allows to send a IN ZLP */
        } else {
            /* A new payload buffer is given */
            udd_ctrl_payload_nb_trans = 0;
            nb_remain                 = udd_g_ctrlreq.payload_size;
        }
    }

    /* Continue transfer and send next data */
    if (nb_remain >= USB_DEVICE_EP_CTRL_SIZE) {
        nb_remain     = USB_DEVICE_EP_CTRL_SIZE;
        b_shortpacket = false;
    } else {
        b_shortpacket = true;
    }

    /* Link payload buffer directly on USB hardware */
    usb_device_endpoint_write_buffer_job(&usb_device, 0, udd_g_ctrlreq.payload + udd_ctrl_payload_nb_trans, nb_remain);

    udd_ctrl_payload_nb_trans += nb_remain;
}

/**
 * \brief Process control endpoint OUT transaction
 * \param[in] pointer Pointer to the endpoint transfer status parameter struct from driver layer.
 */
static void udd_ctrl_out_received(void *pointer) {
    struct usb_endpoint_callback_parameter *ep_callback_para = (struct usb_endpoint_callback_parameter *)pointer;

